{
  "metadata": {
    "case_name": "The Midnight Mystery",
    "victim": "Solicitor Gray",
    "murder_time": "11:50pm",
    "victim_note": "Och, Yer carefully constructed life is built on foundations of sand, and the tide is coming in. I hae spoken wi' the witnesses ye thocht were silenced forever. They telt me aboot the fire, aboot who right started it and why. The insurance money that funded yer rise tae prominence - blood money, every penny of it. Ye smile and charm yer way throo society, but I see the darkness behind yer eyes. Tonight, we end this charade. Meet me and face yer past, or I will ensure everyone knows the truth by morning. The choice is yours.",
    "detective": "Sherlock Holmes",
    "assistant": "Dr. Watson",
    "total_guests": 60,
    "interrogated": 59,
    "locations": [
      "library",
      "ballroom",
      "conservatory",
      "billiard room",
      "study",
      "hall",
      "lounge",
      "dining room",
      "kitchen",
      "cellar",
      "attic",
      "garden",
      "terrace",
      "smoking room",
      "gallery"
    ]
  },
  "interrogations": [
    {
      "guest": "Professor Blackstone",
      "statement": "At that time, I was in the dining room. I often go there in the evenings for admiring the artwork. It's become quite a routine for me. I was in conversation with Baron Nightingale about business matters, I was in conversation with Pemberton about business matters, I spent most of the time chatting with Duchess Summerville, I was in conversation with Lady Crimson about business matters, Grimshaw and I were enjoying the evening together, I was playing cards with Solicitor Beaumont, Grimshaw was there with me, we were having a drink together, Mister Fitzgerald was there with me, we were having a drink together, Sinclair was there with me, we were having a drink together, I spent most of the time chatting with Scarlett, I was in conversation with Judge Winthrop about business matters, Mister Onyx was there with me, we were having a drink together, I was talking with Gold for quite some time, I spent most of the time chatting with Miss Azure, I was playing cards with Archbishop Whitmore, I was playing cards with Brigadier Black, Dean Stonehaven and I were enjoying the evening together, I spent most of the time chatting with Silver, I was in conversation with Ravenswood about business matters, and I was in conversation with Whitmore about business matters. I didn't know what to think when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 5:30am"
    },
    {
      "guest": "Ambassador Indigo",
      "statement": "Well, I can tell you exactly where I was - in the conservatory, listening to music. I remember because I was there from about 11:30pm until well after midnight. Magistrate Ruby and I were discussing the evening's events, I spent most of the time chatting with Blackwood, Brown and I were discussing the evening's events, I was in conversation with Magistrate Ochre about business matters, I was in conversation with Crimson about business matters, Peacock and I were enjoying the evening together, Silver was there with me, we were having a drink together, I was playing cards with Colonel Ravenswood, Baron Sienna and I were discussing the evening's events, Chancellor Harrington and I were discussing the evening's events, I was in conversation with White about business matters, I was in conversation with Ambassador Beaumont about business matters, I spent most of the time chatting with Dean Stonehaven, Miss Coral and I were enjoying the evening together, White and I were discussing the evening's events, I was in conversation with Counselor Montgomery about business matters, I spent most of the time chatting with Viscount Silver, Ivory and I were enjoying the evening together, Whitehall and I were discussing the evening's events, I was in conversation with Counselor Scarlett about business matters, I spent most of the time chatting with Duchess Cunningham, I was in conversation with Coral about business matters, I was playing cards with Major Whitmore, Northbrook and I were discussing the evening's events, I was in conversation with Onyx about business matters, I was talking with Major Beaumont for quite some time, Black was there with me, we were having a drink together, I was talking with Ambassador Umber for quite some time, Pearl was there with me, we were having a drink together, I was playing cards with Inspector Ravenscroft, I spent most of the time chatting with Mister Coral, I spent most of the time chatting with Doctor Grimshaw, Lady Crimson and I were enjoying the evening together, Mister Fitzgerald was there with me, we were having a drink together, I was playing cards with Sapphire, I spent most of the time chatting with Duchess Summerville, and I was playing cards with Ambassador Northbrook. I couldn't understand why when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 6:13am"
    },
    {
      "guest": "Baron Brown",
      "statement": "Well, I can tell you exactly where I was - in the study, having a drink. I remember because I was there from about 11:30pm until well after midnight. Ambassador Peacock was there with me, we were having a drink together, Sienna and I were enjoying the evening together, I was playing cards with Black, Magistrate Ochre and I were enjoying the evening together, I was talking with Ambassador Umber for quite some time, I spent most of the time chatting with Ravenscroft, I was playing cards with Onyx, Ravenswood and I were enjoying the evening together, I was talking with Coral for quite some time, Baron Blackwood was there with me, we were having a drink together, Coral and I were discussing the evening's events, I was in conversation with Major Whitmore about business matters, I spent most of the time chatting with Ambassador Beaumont, I was playing cards with Crimson, I spent most of the time chatting with White, Archbishop Coral and I were enjoying the evening together, I was playing cards with Chancellor Harrington, I was in conversation with White about business matters, I was playing cards with Duchess Ravenswood, Madame Northbrook and I were discussing the evening's events, Scarlett was there with me, we were having a drink together, I was playing cards with Peacock, Viscountess White and I were enjoying the evening together, I spent most of the time chatting with Stonehaven, Montgomery was there with me, we were having a drink together, I spent most of the time chatting with Baron Whitehall, I was playing cards with Ruby, I spent most of the time chatting with Whitmore, and I was playing cards with Baron Nightingale. I was quite shocked when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 2:38am"
    },
    {
      "guest": "Mister Fitzgerald",
      "statement": "I was in the conservatory at 11:50pm exactly, writing letters. It was a quiet evening, and I didn't expect anything unusual to happen. I was in conversation with Rector Violet about business matters, Miss Azure and I were discussing the evening's events, I was in conversation with Onyx about business matters, I was in conversation with Archbishop Whitmore about business matters, Doctor Grimshaw and I were discussing the evening's events, I was in conversation with Ambassador Gold about business matters, I was in conversation with Doctor Scarlett about business matters, I was in conversation with Summerville about business matters, Baron Nightingale and I were discussing the evening's events, I was playing cards with Commodore Ebony, I was playing cards with Solicitor Ravenscroft, I spent most of the time chatting with Countess Grimshaw, Crimson was there with me, we were having a drink together, I was in conversation with Rector Sapphire about business matters, I spent most of the time chatting with Solicitor Beaumont, Blackstone and I were enjoying the evening together, I was playing cards with Sinclair, I was in conversation with Winthrop about business matters, Sienna and I were enjoying the evening together, Ravenswood was there with me, we were having a drink together, I was in conversation with Viscountess White about business matters, Magistrate Ruby was there with me, we were having a drink together, Count Silver and I were enjoying the evening together, Magistrate Ochre was there with me, we were having a drink together, Duchess Cunningham was there with me, we were having a drink together, General White and I were discussing the evening's events, I spent most of the time chatting with Blackwood, and I was playing cards with Ambassador Peacock. I was worried about everyone when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 4:13am"
    },
    {
      "guest": "Commodore White",
      "statement": "At that time, I was in the billiard room. I often go there in the evenings for resting quietly. It's become quite a routine for me. I spent most of the time chatting with Ambassador Peacock, Inspector Ivory was there with me, we were having a drink together, General White and I were enjoying the evening together, I was talking with Archbishop Coral for quite some time, Rector Crimson and I were enjoying the evening together, I was playing cards with Count Silver, I was talking with Baron Brown for quite some time, I was in conversation with Magistrate Ochre about business matters, I was talking with Viscount Silver for quite some time, I was talking with Harrington for quite some time, I spent most of the time chatting with Beaumont, I spent most of the time chatting with Inspector Ravenscroft, I was playing cards with Ambassador Indigo, I was in conversation with Ravenswood about business matters, I spent most of the time chatting with Scarlett, I spent most of the time chatting with Ambassador Beaumont, I spent most of the time chatting with Baron Sienna, I was in conversation with Madame Northbrook about business matters, Peacock and I were enjoying the evening together, I was in conversation with Mister Coral about business matters, I was talking with Onyx for quite some time, Duchess Cunningham was there with me, we were having a drink together, I was playing cards with Miss Coral, I was playing cards with Whitmore, Stonehaven and I were enjoying the evening together, Viscountess White and I were discussing the evening's events, I was in conversation with Baron Whitehall about business matters, Ambassador Umber was there with me, we were having a drink together, I was playing cards with Magistrate Ruby, Brigadier Black and I were discussing the evening's events, I was playing cards with Baron Blackwood, I was in conversation with Whitmore about business matters, and I was talking with Sinclair for quite some time. I didn't expect this when I heard about what happened. As for that note you mentioned, I know nothing about it. I didn't write any note, and I certainly didn't receive one.",
      "timestamp": "Interview conducted at 2:23am"
    },
    {
      "guest": "Magistrate Ochre",
      "statement": "At that time, I was in the garden. I often go there in the evenings for having a drink. It's become quite a routine for me. I spent most of the time chatting with Viscountess White, I was in conversation with Magistrate Ruby about business matters, I was playing cards with Cunningham, I spent most of the time chatting with Peacock, Baron Whitehall was there with me, we were having a drink together, Archbishop Coral and I were enjoying the evening together, I was playing cards with Silver, Chancellor Harrington and I were discussing the evening's events, I was in conversation with Ambassador Umber about business matters, Ambassador Beaumont was there with me, we were having a drink together, I was in conversation with Counselor Scarlett about business matters, I was playing cards with Ravenswood, I was playing cards with Baron Sienna, Onyx was there with me, we were having a drink together, Major Whitmore and I were discussing the evening's events, Ambassador Indigo was there with me, we were having a drink together, I was in conversation with Silver about business matters, I was in conversation with Ravenswood about business matters, Montgomery was there with me, we were having a drink together, Miss Coral and I were discussing the evening's events, I was in conversation with White about business matters, Brigadier Black was there with me, we were having a drink together, I spent most of the time chatting with Baron Blackwood, Inspector Ravenscroft and I were discussing the evening's events, Commodore White and I were enjoying the evening together, I was playing cards with Baron Brown, Peacock and I were discussing the evening's events, I was playing cards with Ivory, I was talking with Ravenscroft for quite some time, and I spent most of the time chatting with Mister Onyx. I couldn't process it when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 4:25am"
    },
    {
      "guest": "Doctor Scarlett",
      "statement": "I was definitely in the kitchen around 11:50pm. I was writing letters and trying to relax after the day's events. I was talking with Countess Grimshaw for quite some time, Blackstone and I were enjoying the evening together, Mister Onyx was there with me, we were having a drink together, I was playing cards with Winthrop, I spent most of the time chatting with Ambassador Gold, Ebony was there with me, we were having a drink together, I was talking with Mister Fitzgerald for quite some time, Baron Nightingale and I were enjoying the evening together, I was in conversation with Solicitor Ravenscroft about business matters, I spent most of the time chatting with Archbishop Whitmore, Lady Crimson and I were discussing the evening's events, I was talking with Solicitor Sinclair for quite some time, I was playing cards with Doctor Grimshaw, I was talking with Sapphire for quite some time, Azure and I were enjoying the evening together, I was playing cards with Solicitor Beaumont, I was in conversation with Pemberton about business matters, I was playing cards with Viscountess White, Commodore White and I were enjoying the evening together, I spent most of the time chatting with Baron Sienna, Major Whitmore and I were discussing the evening's events, Duchess Ravenswood and I were discussing the evening's events, I spent most of the time chatting with Duchess Cunningham, Barrister Peacock and I were enjoying the evening together, I spent most of the time chatting with Pearl, Coral and I were discussing the evening's events, and Coral and I were discussing the evening's events. I was confused when I heard about what happened. As for that note you mentioned, I know nothing about it. I didn't write any note, and I certainly didn't receive one.",
      "timestamp": "Interview conducted at 5:24am"
    },
    {
      "guest": "Miss Azure",
      "statement": "You know, I was just smoking a pipe in the kitchen around 11:50pm. I always spend my evenings there, it's my favorite spot in the house. Baron Nightingale was there with me, we were having a drink together, Blackstone was there with me, we were having a drink together, Crimson and I were discussing the evening's events, Mister Onyx and I were discussing the evening's events, Ambassador Gold was there with me, we were having a drink together, I spent most of the time chatting with Beaumont, I was in conversation with Mister Fitzgerald about business matters, Solicitor Sinclair and I were enjoying the evening together, I was in conversation with Ravenscroft about business matters, I spent most of the time chatting with Sapphire, I was in conversation with Viscount Pemberton about business matters, I was playing cards with Winthrop, Archbishop Whitmore was there with me, we were having a drink together, Doctor Scarlett was there with me, we were having a drink together, I was talking with Ebony for quite some time, Counselor Montgomery and I were enjoying the evening together, Umber and I were enjoying the evening together, Peacock and I were enjoying the evening together, I was playing cards with Baron Whitehall, and I was playing cards with Ravenswood. I couldn't believe it when I heard about what happened. As for that note you mentioned, I know nothing about it. I didn't write any note, and I certainly didn't receive one.",
      "timestamp": "Interview conducted at 2:42am"
    },
    {
      "guest": "Baron Blackwood",
      "statement": "Well, I can tell you exactly where I was - in the study, resting quietly. I remember because I was there from about 11:30pm until well after midnight. I was in conversation with Ambassador Umber about business matters, Montgomery was there with me, we were having a drink together, I was in conversation with Indigo about business matters, I was talking with Earl Pearl for quite some time, I spent most of the time chatting with Inspector Ravenscroft, Magistrate Ruby was there with me, we were having a drink together, Harrington was there with me, we were having a drink together, I was talking with Peacock for quite some time, I was in conversation with Mister Coral about business matters, Stonehaven and I were enjoying the evening together, I was playing cards with Silver, I was talking with Duchess Ravenswood for quite some time, I was playing cards with Madame Northbrook, Viscount Onyx was there with me, we were having a drink together, Ambassador Beaumont and I were discussing the evening's events, I spent most of the time chatting with Archbishop Coral, I spent most of the time chatting with General White, I was playing cards with Viscountess White, I was playing cards with Sienna, Duchess Cunningham and I were enjoying the evening together, I was in conversation with Brown about business matters, I was in conversation with Scarlett about business matters, I was talking with Beaumont for quite some time, I spent most of the time chatting with Barrister Peacock, I was talking with Rector Crimson for quite some time, I was in conversation with Whitehall about business matters, I spent most of the time chatting with Count Silver, I was in conversation with Whitmore about business matters, Onyx was there with me, we were having a drink together, I was talking with Whitmore for quite some time, I was talking with Summerville for quite some time, Ambassador Gold and I were enjoying the evening together, Violet was there with me, we were having a drink together, and I also think I saw Doctor Ashcroft, but I'm not entirely sure. I couldn't believe it when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 5:52am"
    },
    {
      "guest": "Counselor Scarlett",
      "statement": "Well, I can tell you exactly where I was - in the garden, reading a book. I remember because I was there from about 11:30pm until well after midnight. Whitmore and I were discussing the evening's events, I was playing cards with Miss Coral, Barrister Peacock and I were enjoying the evening together, White and I were enjoying the evening together, I was talking with Ambassador Peacock for quite some time, Colonel Ravenswood was there with me, we were having a drink together, Baron Blackwood and I were enjoying the evening together, I was in conversation with Silver about business matters, Cunningham and I were discussing the evening's events, I was in conversation with Ambassador Indigo about business matters, I was in conversation with Magistrate Ochre about business matters, Harrington was there with me, we were having a drink together, Coral and I were discussing the evening's events, I spent most of the time chatting with Baron Sienna, I was talking with General White for quite some time, Madame Northbrook and I were enjoying the evening together, Brown was there with me, we were having a drink together, Viscount Onyx and I were enjoying the evening together, I was in conversation with Ambassador Beaumont about business matters, I spent most of the time chatting with Ambassador Umber, Commodore White and I were discussing the evening's events, I spent most of the time chatting with Rector Crimson, I was in conversation with Mister Coral about business matters, I spent most of the time chatting with Duchess Ravenswood, Major Beaumont was there with me, we were having a drink together, I was playing cards with Earl Pearl, I was talking with Stonehaven for quite some time, I spent most of the time chatting with Baron Nightingale, I was in conversation with Beaumont about business matters, I spent most of the time chatting with Judge Winthrop, I was talking with Duchess Summerville for quite some time, and Commodore Ebony and I were discussing the evening's events. I was worried about everyone when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 1:18am"
    },
    {
      "guest": "Rector Violet",
      "statement": "Well, I can tell you exactly where I was - in the cellar, having a drink. I remember because I was there from about 11:30pm until well after midnight. Lady Crimson was there with me, we were having a drink together, I spent most of the time chatting with Solicitor Beaumont, I was talking with Countess Grimshaw for quite some time, I was talking with Archbishop Whitmore for quite some time, Duchess Summerville and I were enjoying the evening together, I spent most of the time chatting with Mister Fitzgerald, I spent most of the time chatting with Viscount Pemberton, I was talking with Commodore Ebony for quite some time, Azure was there with me, we were having a drink together, I was playing cards with Winthrop, I was playing cards with Ambassador Gold, I was playing cards with Grimshaw, Rector Sapphire and I were discussing the evening's events, I was playing cards with Professor Blackstone, I spent most of the time chatting with Baron Nightingale, Mister Onyx and I were discussing the evening's events, I was talking with Solicitor Ravenscroft for quite some time, I was playing cards with Major Beaumont, I spent most of the time chatting with Coral, I was playing cards with Baron Blackwood, I was playing cards with Counselor Montgomery, I spent most of the time chatting with Ambassador Peacock, and Earl Pearl was there with me, we were having a drink together. I didn't expect this when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 3:37am"
    },
    {
      "guest": "Barrister Beaumont",
      "statement": "I was definitely in the lounge late in the evening. I was listening to music and trying to relax after the day's events. Counselor Montgomery and I were discussing the evening's events, and I was in conversation with Indigo about business matters. I was terrified when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 2:35am"
    },
    {
      "guest": "Commodore Ebony",
      "statement": "At that time, I was in the gallery. I often go there in the evenings for playing cards. It's become quite a routine for me. I was in conversation with Summerville about business matters, Judge Winthrop was there with me, we were having a drink together, Beaumont and I were discussing the evening's events, Professor Blackstone and I were enjoying the evening together, Gold and I were discussing the evening's events, Rector Violet was there with me, we were having a drink together, Doctor Grimshaw was there with me, we were having a drink together, Mister Onyx and I were enjoying the evening together, I was in conversation with Viscount Pemberton about business matters, I was in conversation with Archbishop Whitmore about business matters, Rector Sapphire and I were enjoying the evening together, I was in conversation with Miss Azure about business matters, Countess Grimshaw and I were enjoying the evening together, I spent most of the time chatting with Fitzgerald, I was playing cards with Scarlett, I was playing cards with Sinclair, I was playing cards with Solicitor Ravenscroft, Silver and I were enjoying the evening together, I spent most of the time chatting with Barrister Peacock, and I spent most of the time chatting with Pearl. I didn't expect this when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 6:36am"
    },
    {
      "guest": "Baron Sienna",
      "statement": "I wis definitely in the cellar jist afore midnight. I wis taking a walk and trying tae relax efter the day's events. Brown and I were discussing the evening's events, Scarlett and I were enjoying the e'en together, I wis in conversation wi' Count Silver aboot business matters, I wis talking wi' Blackwood fer gey some time, I wis in conversation wi' Ivory aboot business matters, I wis playing cards wi' Northbrook, I wis talking wi' Peacock fer gey some time, I wis in conversation wi' Dean Stonehaven aboot business matters, I spent most of the time chatting wi' Beaumont, Coral and I were discussing the evening's events, I spent most of the time chatting wi' Ravenswood, I wis talking wi' Magistrate Ruby fer gey some time, Archbishop Coral wis thair wi' me, we were having a drink together, Beaumont wis thair wi' me, we were having a drink together, Viscount Silver wis thair wi' me, we were having a drink together, Barrister Peacock and I were discussing the evening's events, Counselor Montgomery and I were enjoying the e'en together, I wis in conversation wi' Harrington aboot business matters, Baron Whitehall and I were discussing the evening's events, I spent most of the time chatting wi' White, I spent most of the time chatting wi' Major Whitmore, I wis talking wi' Ravenswood fer gey some time, I wis in conversation wi' Ambassador Indigo aboot business matters, Viscountess White and I were discussing the evening's events, Brigadier Black and I were enjoying the e'en together, I spent most of the time chatting wi' Rector Crimson, I wis talking wi' Magistrate Ochre fer gey some time, I wis in conversation wi' Ambassador Umber aboot business matters, I wis talking wi' Earl Pearl fer gey some time, Duchess Cunningham and I were enjoying the e'en together, I wis talking wi' Ravenscroft fer gey some time, I wis in conversation wi' Gold aboot business matters, Professor Blackstone and I were enjoying the e'en together, I wis in conversation wi' Rector Violet aboot business matters, I wis playing cards wi' Mister Onyx, Lady Crimson and I were discussing the evening's events, and Someone who might hae been Doctor Ashcroft walked by quickly. I wis terrified whan I heard aboot whit happened. I dinnae ken anythin' aboot a note. This is the first I'm hearing of it, and I can assure ye I had nothin' tae do wi' it.",
      "timestamp": "Interview conducted at 5:57am"
    },
    {
      "guest": "Magistrate Ruby",
      "statement": "You know, I was just resting quietly in the lounge late in the evening. I always spend my evenings there, it's my favorite spot in the house. Ambassador Beaumont was there with me, we were having a drink together, Duchess Ravenswood and I were enjoying the evening together, Colonel Ravenswood and I were discussing the evening's events, Barrister Peacock and I were enjoying the evening together, I was in conversation with Major Whitmore about business matters, I was playing cards with Counselor Scarlett, I was talking with Pearl for quite some time, I was in conversation with Ochre about business matters, Coral and I were discussing the evening's events, I was talking with Indigo for quite some time, Count Silver and I were discussing the evening's events, I was talking with Montgomery for quite some time, I was talking with Viscount Onyx for quite some time, I was playing cards with Coral, I was in conversation with Viscount Silver about business matters, Baron Sienna and I were discussing the evening's events, White was there with me, we were having a drink together, I was playing cards with Ivory, Crimson and I were enjoying the evening together, I was playing cards with Brigadier Black, Umber was there with me, we were having a drink together, Baron Blackwood and I were discussing the evening's events, I was playing cards with Ambassador Peacock, I was in conversation with Dean Stonehaven about business matters, Baron Brown was there with me, we were having a drink together, Inspector Ravenscroft and I were enjoying the evening together, I was in conversation with Archbishop Coral about business matters, I was playing cards with Harrington, Sinclair and I were enjoying the evening together, I was talking with Doctor Scarlett for quite some time, Beaumont and I were enjoying the evening together, and I was in conversation with Beaumont about business matters. I didn't know what to think when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 6:30am"
    },
    {
      "guest": "Colonel Ravenswood",
      "statement": "I was in the hall right at 11:50pm, enjoying the evening. It was a quiet evening, and I didn't expect anything unusual to happen. I was playing cards with Ambassador Beaumont, Rector Crimson and I were discussing the evening's events, I spent most of the time chatting with Pearl, I was in conversation with Chancellor Harrington about business matters, Scarlett and I were enjoying the evening together, Dean Stonehaven was there with me, we were having a drink together, I was in conversation with White about business matters, Silver and I were discussing the evening's events, I spent most of the time chatting with Major Beaumont, I was talking with Ambassador Umber for quite some time, Whitehall and I were enjoying the evening together, I was in conversation with White about business matters, I was in conversation with Northbrook about business matters, Ravenscroft and I were discussing the evening's events, Coral and I were enjoying the evening together, I was playing cards with Counselor Montgomery, Ravenswood and I were enjoying the evening together, Magistrate Ruby and I were discussing the evening's events, Commodore White and I were discussing the evening's events, Baron Blackwood was there with me, we were having a drink together, Count Silver and I were enjoying the evening together, Magistrate Ochre and I were discussing the evening's events, Whitmore and I were enjoying the evening together, I was talking with Inspector Ivory for quite some time, Coral and I were enjoying the evening together, I was talking with Baron Sienna for quite some time, I was playing cards with Peacock, I was talking with Ambassador Indigo for quite some time, I spent most of the time chatting with Coral, I was in conversation with Commodore Ebony about business matters, I was in conversation with Ravenscroft about business matters, Ambassador Gold and I were enjoying the evening together, Sinclair and I were discussing the evening's events, and Countess Grimshaw and I were discussing the evening's events. I couldn't understand why when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 6:51am"
    },
    {
      "guest": "Major Beaumont",
      "statement": "Well, I can tell you exactly where I was - in the billiard room, talking with friends. I remember because I was there from about 11:30pm until well after midnight. Miss Coral and I were discussing the evening's events, Scarlett and I were enjoying the evening together, I was in conversation with Viscountess White about business matters, I was talking with Ambassador Beaumont for quite some time, I spent most of the time chatting with Chancellor Harrington, Inspector Ivory was there with me, we were having a drink together, I was in conversation with Baron Whitehall about business matters, I was talking with Barrister Peacock for quite some time, Ruby and I were enjoying the evening together, Duchess Cunningham and I were enjoying the evening together, I was playing cards with Archbishop Coral, I was playing cards with Viscount Silver, I was in conversation with Inspector Ravenscroft about business matters, I was talking with Northbrook for quite some time, Ambassador Indigo and I were discussing the evening's events, Commodore White and I were enjoying the evening together, Pearl and I were enjoying the evening together, I was in conversation with Counselor Montgomery about business matters, Dean Stonehaven was there with me, we were having a drink together, Brigadier Black was there with me, we were having a drink together, I spent most of the time chatting with Ochre, I was playing cards with Baron Blackwood, I was playing cards with Ravenswood, Silver was there with me, we were having a drink together, Peacock and I were enjoying the evening together, I was talking with General White for quite some time, I was talking with Major Whitmore for quite some time, I spent most of the time chatting with Lady Crimson, I spent most of the time chatting with Rector Sapphire, and I was playing cards with Solicitor Sinclair. I was terrified when I heard about what happened. As for that note you mentioned, I know nothing about it. I didn't write any note, and I certainly didn't receive one.",
      "timestamp": "Interview conducted at 2:45am"
    },
    {
      "guest": "Earl Pearl",
      "statement": "At that time, I was in the conservatory. I often go there in the evenings for discussing business. It's become quite a routine for me. Ruby and I were discussing the evening's events, I was in conversation with Black about business matters, Miss Coral and I were enjoying the evening together, Sienna and I were discussing the evening's events, Ambassador Beaumont was there with me, we were having a drink together, I was in conversation with Viscountess White about business matters, I was in conversation with Colonel Ravenswood about business matters, Rector Crimson and I were enjoying the evening together, I spent most of the time chatting with Coral, I was playing cards with Barrister Peacock, General White was there with me, we were having a drink together, I was talking with Ambassador Umber for quite some time, Beaumont and I were discussing the evening's events, Magistrate Ochre and I were enjoying the evening together, I spent most of the time chatting with Ravenscroft, I was in conversation with Viscount Onyx about business matters, I spent most of the time chatting with Dean Stonehaven, Peacock and I were enjoying the evening together, Counselor Scarlett was there with me, we were having a drink together, Baron Blackwood and I were discussing the evening's events, I was talking with Ambassador Indigo for quite some time, I spent most of the time chatting with Whitmore, I was in conversation with Count Silver about business matters, White and I were enjoying the evening together, I was in conversation with Madame Northbrook about business matters, I was in conversation with Chancellor Harrington about business matters, Inspector Ivory was there with me, we were having a drink together, I was talking with Counselor Montgomery for quite some time, Rector Violet was there with me, we were having a drink together, Ravenscroft and I were enjoying the evening together, and Miss Azure and I were discussing the evening's events. I didn't expect this when I heard about what happened. As for that note you mentioned, I know nothing about it. I didn't write any note, and I certainly didn't receive one.",
      "timestamp": "Interview conducted at 3:54am"
    },
    {
      "guest": "Ambassador Gold",
      "statement": "I was definitely in the kitchen right at 11:50pm. I was admiring the artwork and trying to relax after the day's events. I was playing cards with Fitzgerald, I was talking with Archbishop Whitmore for quite some time, I was talking with Beaumont for quite some time, Miss Azure was there with me, we were having a drink together, I was in conversation with Baron Nightingale about business matters, I was in conversation with Summerville about business matters, I was talking with Mister Onyx for quite some time, I was in conversation with Grimshaw about business matters, I spent most of the time chatting with Solicitor Ravenscroft, Sapphire was there with me, we were having a drink together, Professor Blackstone and I were enjoying the evening together, I was playing cards with Scarlett, I was in conversation with Solicitor Sinclair about business matters, Violet and I were discussing the evening's events, I was talking with Pemberton for quite some time, I was talking with Northbrook for quite some time, I spent most of the time chatting with Magistrate Ruby, I was talking with Counselor Montgomery for quite some time, and Chancellor Harrington was there with me, we were having a drink together. I couldn't believe it when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 5:33am"
    },
    {
      "guest": "Duchess Ravenswood",
      "statement": "I was in the dining room when the clock struck twelve, reading a book. It was a quiet evening, and I didn't expect anything unusual to happen. I was playing cards with Silver, Ambassador Umber and I were discussing the evening's events, Ochre was there with me, we were having a drink together, I was talking with Peacock for quite some time, Ambassador Beaumont was there with me, we were having a drink together, Inspector Ivory and I were enjoying the evening together, I was playing cards with Peacock, Baron Sienna and I were discussing the evening's events, I was playing cards with Viscount Silver, Major Whitmore and I were enjoying the evening together, Colonel Ravenswood and I were enjoying the evening together, I was in conversation with Onyx about business matters, I was playing cards with White, I spent most of the time chatting with Counselor Scarlett, Ruby and I were discussing the evening's events, I was talking with Counselor Montgomery for quite some time, I was talking with Baron Whitehall for quite some time, I was talking with Duchess Cunningham for quite some time, Mister Coral and I were enjoying the evening together, I was talking with Ambassador Indigo for quite some time, I was talking with Stonehaven for quite some time, Ravenscroft and I were enjoying the evening together, Brigadier Black and I were enjoying the evening together, I was talking with Major Beaumont for quite some time, I was talking with Miss Coral for quite some time, Baron Blackwood and I were discussing the evening's events, Madame Northbrook and I were discussing the evening's events, I was playing cards with Brown, General White was there with me, we were having a drink together, White and I were enjoying the evening together, I was in conversation with Nightingale about business matters, Scarlett and I were enjoying the evening together, I was playing cards with Onyx, I spent most of the time chatting with Countess Grimshaw, and Ambassador Northbrook was there with me, we were having a drink together. I was confused when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 1:58am"
    },
    {
      "guest": "Brigadier Black",
      "statement": "I wis definitely in the ballroom whan the clock struck twelve. I wis listening tae music and trying tae relax efter the day's events. I wis in conversation wi' Northbrook aboot business matters, I wis playing cards wi' Major Beaumont, I wis playing cards wi' Baron Whitehall, I wis talking wi' Major Whitmore fer gey some time, I wis playing cards wi' Blackwood, I wis talking wi' White fer gey some time, I wis playing cards wi' Baron Brown, Scarlett wis thair wi' me, we were having a drink together, Counselor Montgomery and I were discussing the evening's events, I wis in conversation wi' Ambassador Peacock aboot business matters, I wis talking wi' Ambassador Umber fer gey some time, I wis in conversation wi' Mister Coral aboot business matters, I wis talking wi' Peacock fer gey some time, I wis talking wi' Dean Stonehaven fer gey some time, I wis playing cards wi' Magistrate Ochre, Viscount Silver and I were discussing the evening's events, Onyx and I were enjoying the e'en together, Miss Coral and I were enjoying the e'en together, Ravenswood and I were discussing the evening's events, I wis playing cards wi' Viscountess White, I wis playing cards wi' Duchess Cunningham, Magistrate Ruby and I were enjoying the e'en together, I wis playing cards wi' General White, I spent most of the time chatting wi' Count Silver, I spent most of the time chatting wi' Inspector Ivory, Ambassador Indigo and I were discussing the evening's events, I wis playing cards wi' Sienna, I spent most of the time chatting wi' Inspector Ravenscroft, I wis talking wi' Archbishop Coral fer gey some time, Professor Blackstone and I were enjoying the e'en together, Scarlett and I were enjoying the e'en together, Onyx wis thair wi' me, we were having a drink together, Duchess Summerville and I were enjoying the e'en together, I wis playing cards wi' Green, and I caught a glimpse of someone who looked like Doctor Ashcroft. I wis confused whan I heard aboot whit happened. I'm afraid I cannae help ye wi' any note. I dinnae write one, dinnae receive one, and dinnae see one.",
      "timestamp": "Interview conducted at 4:43am"
    },
    {
      "guest": "Miss Coral",
      "statement": "Well, I can tell you exactly where I was - in the terrace, playing cards. I remember because I was there from about 11:30pm until well after midnight. I was playing cards with Ravenscroft, I was in conversation with Archbishop Coral about business matters, Baron Whitehall was there with me, we were having a drink together, I was in conversation with Scarlett about business matters, I was playing cards with Mister Coral, Chancellor Harrington and I were enjoying the evening together, Viscount Silver and I were enjoying the evening together, I was playing cards with Whitmore, Viscountess White was there with me, we were having a drink together, I was in conversation with Commodore White about business matters, Montgomery was there with me, we were having a drink together, I was in conversation with Duchess Ravenswood about business matters, Ambassador Peacock was there with me, we were having a drink together, Earl Pearl was there with me, we were having a drink together, Silver and I were enjoying the evening together, I spent most of the time chatting with Ochre, I was playing cards with Dean Stonehaven, I was talking with Ambassador Umber for quite some time, Viscount Onyx was there with me, we were having a drink together, Duchess Cunningham was there with me, we were having a drink together, Magistrate Ruby and I were discussing the evening's events, I was playing cards with Blackwood, White and I were discussing the evening's events, Sienna and I were enjoying the evening together, Ravenswood and I were discussing the evening's events, I was playing cards with Ambassador Indigo, I was playing cards with Ambassador Beaumont, Beaumont and I were enjoying the evening together, Barrister Peacock and I were discussing the evening's events, Ivory and I were discussing the evening's events, I was in conversation with Black about business matters, I was talking with Viscount Pemberton for quite some time, Solicitor Beaumont and I were discussing the evening's events, I was playing cards with Barrister Beaumont, and I spent most of the time chatting with Northbrook. I was worried about everyone when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 6:45am"
    },
    {
      "guest": "Mister Onyx",
      "statement": "I was in the library late in the evening, smoking a pipe. It was a quiet evening, and I didn't expect anything unusual to happen. I was playing cards with Crimson, Pemberton and I were enjoying the evening together, Solicitor Beaumont and I were discussing the evening's events, Ravenscroft and I were discussing the evening's events, I was in conversation with Judge Winthrop about business matters, I was in conversation with Professor Blackstone about business matters, I spent most of the time chatting with Azure, Violet and I were enjoying the evening together, I was talking with Whitmore for quite some time, Doctor Scarlett and I were discussing the evening's events, Grimshaw was there with me, we were having a drink together, Countess Grimshaw was there with me, we were having a drink together, I spent most of the time chatting with Commodore Ebony, I was in conversation with Duchess Summerville about business matters, Baron Nightingale and I were discussing the evening's events, I was playing cards with Northbrook, I was talking with Pearl for quite some time, I was in conversation with Coral about business matters, and Beaumont and I were discussing the evening's events. I was worried about everyone when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 2:25am"
    },
    {
      "guest": "Chancellor Harrington",
      "statement": "You know, I was just smoking a pipe in the smoking room just before midnight. I always spend my evenings there, it's my favorite spot in the house. Rector Crimson and I were enjoying the evening together, I was talking with Magistrate Ruby for quite some time, I spent most of the time chatting with Major Beaumont, I was playing cards with White, I spent most of the time chatting with Stonehaven, Cunningham and I were discussing the evening's events, I was talking with Inspector Ivory for quite some time, White and I were enjoying the evening together, I was in conversation with Coral about business matters, I was playing cards with Ravenswood, I was talking with Miss Coral for quite some time, I was talking with Ravenscroft for quite some time, Counselor Montgomery and I were discussing the evening's events, I was talking with Ambassador Peacock for quite some time, I was playing cards with Madame Northbrook, I was playing cards with Whitehall, Blackwood was there with me, we were having a drink together, I was talking with Black for quite some time, Baron Sienna was there with me, we were having a drink together, I was in conversation with Umber about business matters, I was in conversation with Count Silver about business matters, I spent most of the time chatting with Barrister Peacock, I was talking with Duchess Ravenswood for quite some time, I was playing cards with Commodore White, Baron Brown was there with me, we were having a drink together, I was in conversation with Coral about business matters, I was in conversation with Viscount Onyx about business matters, I was playing cards with Earl Pearl, I spent most of the time chatting with Major Whitmore, Viscount Silver and I were enjoying the evening together, I was talking with Ambassador Indigo for quite some time, I spent most of the time chatting with Archbishop Whitmore, Doctor Grimshaw and I were enjoying the evening together, Ravenscroft was there with me, we were having a drink together, and I was talking with Ambassador Northbrook for quite some time. I was quite shocked when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 6:28am"
    },
    {
      "guest": "Countess Grimshaw",
      "statement": "You know, I was just having a drink in the ballroom when the clock struck twelve. I always spend my evenings there, it's my favorite spot in the house. Winthrop and I were discussing the evening's events, I spent most of the time chatting with Ravenscroft, I was in conversation with Solicitor Sinclair about business matters, I was in conversation with Ambassador Gold about business matters, I was playing cards with Viscount Pemberton, I spent most of the time chatting with Miss Azure, I spent most of the time chatting with Rector Sapphire, I spent most of the time chatting with Solicitor Beaumont, I was playing cards with Baron Nightingale, Grimshaw was there with me, we were having a drink together, Professor Blackstone and I were enjoying the evening together, I was talking with Ebony for quite some time, Mister Onyx and I were discussing the evening's events, I spent most of the time chatting with Crimson, Summerville was there with me, we were having a drink together, I was talking with Rector Violet for quite some time, Scarlett and I were enjoying the evening together, Major Beaumont was there with me, we were having a drink together, I spent most of the time chatting with Ravenscroft, I was playing cards with Commodore White, I was talking with Colonel Ravenswood for quite some time, Viscountess White and I were enjoying the evening together, Whitehall was there with me, we were having a drink together, Earl Pearl was there with me, we were having a drink together, I was in conversation with Whitmore about business matters, I was playing cards with Ochre, and Barrister Beaumont and I were enjoying the evening together. I was worried about everyone when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 2:22am"
    },
    {
      "guest": "Doctor Ashcroft",
      "statement": "I wis definitely in the conservatory jist afore midnight. I wis talking wi' friends and trying tae relax efter the day's events. I dinnae notice anyone else around. I wis lost in ma thoughts and wasnae right looking. I couldnae believe it whan I heard aboot whit happened. I dinnae ken anythin' aboot a note. This is the first I'm hearing of it, and I can assure ye I had nothin' tae do wi' it.",
      "timestamp": "Interview conducted at 4:42am"
    },
    {
      "guest": "Archbishop Whitmore",
      "statement": "I was definitely in the attic right at 11:50pm. I was admiring the artwork and trying to relax after the day's events. I was in conversation with Violet about business matters, Doctor Scarlett and I were discussing the evening's events, I spent most of the time chatting with Solicitor Beaumont, Countess Grimshaw and I were enjoying the evening together, Commodore Ebony was there with me, we were having a drink together, I was playing cards with Rector Sapphire, Pemberton and I were discussing the evening's events, I was in conversation with Gold about business matters, I was talking with Solicitor Sinclair for quite some time, I was playing cards with Mister Fitzgerald, Ravenscroft and I were enjoying the evening together, Winthrop and I were enjoying the evening together, I was playing cards with Doctor Grimshaw, Crimson and I were discussing the evening's events, Azure was there with me, we were having a drink together, Professor Blackstone and I were enjoying the evening together, I was in conversation with Northbrook about business matters, I was playing cards with Baron Whitehall, Harrington was there with me, we were having a drink together, I was playing cards with Scarlett, Miss Coral and I were enjoying the evening together, I was in conversation with Ochre about business matters, and I was in conversation with Beaumont about business matters. I couldn't understand why when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 3:39am"
    },
    {
      "guest": "Madame Northbrook",
      "statement": "You know, I was just writing letters in the conservatory around 11:50pm. I always spend my evenings there, it's my favorite spot in the house. I was in conversation with Commodore White about business matters, Viscount Silver was there with me, we were having a drink together, I was talking with Magistrate Ochre for quite some time, I was in conversation with Major Beaumont about business matters, Ravenswood and I were enjoying the evening together, I was in conversation with Rector Crimson about business matters, Miss Coral and I were discussing the evening's events, I was talking with Baron Blackwood for quite some time, Magistrate Ruby and I were discussing the evening's events, I was in conversation with White about business matters, Count Silver and I were discussing the evening's events, I was in conversation with Mister Coral about business matters, I was in conversation with Onyx about business matters, I was playing cards with Counselor Scarlett, I was playing cards with Ambassador Peacock, Umber and I were enjoying the evening together, Stonehaven and I were enjoying the evening together, I was in conversation with Black about business matters, I was playing cards with Counselor Montgomery, I was in conversation with White about business matters, Inspector Ravenscroft and I were discussing the evening's events, I spent most of the time chatting with Baron Whitehall, I was in conversation with Inspector Ivory about business matters, I was in conversation with Chancellor Harrington about business matters, Whitmore and I were enjoying the evening together, I was in conversation with Earl Pearl about business matters, I was in conversation with Beaumont about business matters, Duchess Cunningham and I were enjoying the evening together, I was in conversation with Ambassador Indigo about business matters, Archbishop Coral and I were discussing the evening's events, Peacock and I were enjoying the evening together, Ebony was there with me, we were having a drink together, I was talking with Doctor Scarlett for quite some time, I was in conversation with Baron Nightingale about business matters, and Solicitor Sinclair and I were enjoying the evening together. I couldn't process it when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 6:15am"
    },
    {
      "guest": "Viscountess White",
      "statement": "I was in the terrace at 11:50pm exactly, enjoying the evening. It was a quiet evening, and I didn't expect anything unusual to happen. Ambassador Umber and I were enjoying the evening together, Brigadier Black and I were enjoying the evening together, Peacock and I were discussing the evening's events, Count Silver and I were discussing the evening's events, I was talking with Madame Northbrook for quite some time, Magistrate Ochre and I were enjoying the evening together, Ruby was there with me, we were having a drink together, I was talking with Peacock for quite some time, I was playing cards with Mister Coral, Duchess Ravenswood and I were enjoying the evening together, Montgomery was there with me, we were having a drink together, I was talking with Major Beaumont for quite some time, I was playing cards with Cunningham, I was playing cards with Ambassador Indigo, Major Whitmore was there with me, we were having a drink together, I spent most of the time chatting with Ravenswood, Viscount Silver and I were enjoying the evening together, Brown and I were enjoying the evening together, Rector Crimson and I were discussing the evening's events, I was playing cards with Coral, I was talking with Baron Blackwood for quite some time, Dean Stonehaven and I were discussing the evening's events, Archbishop Coral and I were enjoying the evening together, Viscount Onyx and I were enjoying the evening together, Counselor Scarlett and I were enjoying the evening together, I was talking with Ivory for quite some time, I spent most of the time chatting with Ambassador Beaumont, I spent most of the time chatting with Harrington, I spent most of the time chatting with Commodore White, I was talking with Rector Violet for quite some time, I was in conversation with Miss Azure about business matters, I was talking with Mister Fitzgerald for quite some time, Whitmore and I were enjoying the evening together, and I was playing cards with Beaumont. I was quite shocked when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 2:54am"
    },
    {
      "guest": "Rector Sapphire",
      "statement": "I was in the attic at 11:50pm exactly, playing cards. It was a quiet evening, and I didn't expect anything unusual to happen. I spent most of the time chatting with Solicitor Sinclair, Baron Nightingale and I were discussing the evening's events, Commodore Ebony and I were enjoying the evening together, Ambassador Gold and I were discussing the evening's events, Doctor Scarlett was there with me, we were having a drink together, Judge Winthrop and I were discussing the evening's events, I was in conversation with Countess Grimshaw about business matters, Crimson and I were discussing the evening's events, I spent most of the time chatting with Grimshaw, I was playing cards with Duchess Summerville, Rector Violet and I were enjoying the evening together, I was playing cards with Solicitor Ravenscroft, I was playing cards with Mister Onyx, I was talking with Miss Azure for quite some time, I was playing cards with Solicitor Beaumont, I was in conversation with Archbishop Whitmore about business matters, I was talking with Blackstone for quite some time, I was in conversation with Baron Blackwood about business matters, Major Beaumont was there with me, we were having a drink together, Harrington was there with me, we were having a drink together, I was in conversation with Peacock about business matters, Rector Crimson and I were enjoying the evening together, I was in conversation with Major Whitmore about business matters, and I spent most of the time chatting with Lord Green. I didn't expect this when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 3:40am"
    },
    {
      "guest": "Solicitor Sinclair",
      "statement": "I was definitely in the lounge around 11:50pm. I was smoking a pipe and trying to relax after the day's events. I was in conversation with Solicitor Ravenscroft about business matters, Pemberton and I were discussing the evening's events, I was talking with Countess Grimshaw for quite some time, Winthrop and I were discussing the evening's events, I was in conversation with Nightingale about business matters, Rector Sapphire and I were enjoying the evening together, Ebony was there with me, we were having a drink together, I was talking with Fitzgerald for quite some time, Duchess Summerville and I were enjoying the evening together, I was playing cards with Miss Azure, Onyx and I were enjoying the evening together, Professor Blackstone was there with me, we were having a drink together, Violet and I were discussing the evening's events, Gold and I were discussing the evening's events, Doctor Scarlett was there with me, we were having a drink together, I was playing cards with Doctor Grimshaw, I spent most of the time chatting with Coral, I was talking with Mister Coral for quite some time, I was talking with Counselor Montgomery for quite some time, Ruby and I were enjoying the evening together, I spent most of the time chatting with Baron Blackwood, I was talking with Baron Brown for quite some time, I was talking with Stonehaven for quite some time, I was talking with Beaumont for quite some time, and I was in conversation with Northbrook about business matters. I was terrified when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 3:39am"
    },
    {
      "guest": "Viscount Pemberton",
      "statement": "Ye know, I wus jist reading a book in the cellar jist afore midnight. I aye spend ma evenings there, it's ma favorite spot in the house. Sinclair and I were enjoying the e'en together, Doctor Grimshaw and I were discussing the evening's events, I wus in conversation wi' Baron Nightingale aboot business matters, I wus in conversation wi' Rector Violet aboot business matters, Solicitor Ravenscroft and I were enjoying the e'en together, I wus talking wi' Gold fer gey some time, I wus playing cards wi' Rector Sapphire, I wus playing cards wi' Fitzgerald, I spent most of the time chatting wi' Mister Onyx, Whitmore and I were discussing the evening's events, I wus talking wi' Crimson fer gey some time, Solicitor Beaumont and I were discussing the evening's events, I spent most of the time chatting wi' Professor Blackstone, I spent most of the time chatting wi' Commodore Ebony, I spent most of the time chatting wi' Doctor Scarlett, I spent most of the time chatting wi' Summerville, I wus in conversation wi' Northbrook aboot business matters, I wus playing cards wi' Cunningham, I wus in conversation wi' Baron Sienna aboot business matters, Peacock and I were enjoying the e'en together, I spent most of the time chatting wi' General White, and I spent most of the time chatting wi' Silver. I wus worried aboot everyone whan I heard aboot whit happened. I'm afraid I cannae help ye wi' any note. I didnae write one, didnae receive one, and didnae see one.",
      "timestamp": "Interview conducted at 4:18am"
    },
    {
      "guest": "Judge Winthrop",
      "statement": "I was definitely in the ballroom right at 11:50pm. I was smoking a pipe and trying to relax after the day's events. I was talking with Ravenscroft for quite some time, I was playing cards with Doctor Scarlett, Ambassador Gold and I were enjoying the evening together, I spent most of the time chatting with Professor Blackstone, I was playing cards with Beaumont, I was talking with Pemberton for quite some time, I was talking with Ebony for quite some time, Azure and I were enjoying the evening together, I was talking with Grimshaw for quite some time, I spent most of the time chatting with Whitmore, Solicitor Sinclair was there with me, we were having a drink together, I was playing cards with Fitzgerald, I was talking with Crimson for quite some time, I was talking with Rector Violet for quite some time, I spent most of the time chatting with Mister Onyx, I spent most of the time chatting with Harrington, Silver and I were enjoying the evening together, I was playing cards with Beaumont, I was playing cards with Indigo, I was playing cards with Ravenswood, I was in conversation with Major Whitmore about business matters, and Blackwood and I were discussing the evening's events. I couldn't process it when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 5:54am"
    },
    {
      "guest": "Lord Green",
      "statement": "Well, I can tell you exactly where I was - in the lounge, enjoying the evening. I remember because I was there from about 11:30pm until well after midnight. I didn't notice anyone else around. I was lost in my thoughts and wasn't really looking. I was confused when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 2:18am"
    },
    {
      "guest": "Baron Nightingale",
      "statement": "Well, I can tell you exactly where I was - in the lounge, admiring the artwork. I remember because I was there from about 11:30pm until well after midnight. I was in conversation with Sinclair about business matters, Mister Onyx and I were enjoying the evening together, Sapphire and I were enjoying the evening together, I was in conversation with Professor Blackstone about business matters, I was in conversation with Scarlett about business matters, I was playing cards with Rector Violet, Beaumont and I were discussing the evening's events, I was in conversation with Ravenscroft about business matters, I was in conversation with Ambassador Gold about business matters, I was playing cards with Grimshaw, I was in conversation with Mister Fitzgerald about business matters, I was in conversation with Whitmore about business matters, Miss Azure and I were discussing the evening's events, Lady Crimson was there with me, we were having a drink together, I was in conversation with Duchess Summerville about business matters, I was in conversation with Sienna about business matters, Silver and I were enjoying the evening together, Inspector Ivory and I were enjoying the evening together, I was talking with Chancellor Harrington for quite some time, I was talking with Rector Crimson for quite some time, I was talking with Mister Coral for quite some time, I was playing cards with Brown, and Lord Green and I were enjoying the evening together. I didn't know what to think when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 2:13am"
    },
    {
      "guest": "General White",
      "statement": "I was definitely in the cellar at 11:50pm exactly. I was smoking a pipe and trying to relax after the day's events. Baron Brown was there with me, we were having a drink together, Magistrate Ochre and I were enjoying the evening together, Inspector Ravenscroft was there with me, we were having a drink together, I was in conversation with Silver about business matters, I was playing cards with Brigadier Black, Coral was there with me, we were having a drink together, Viscount Onyx was there with me, we were having a drink together, Peacock and I were enjoying the evening together, I was in conversation with Northbrook about business matters, I spent most of the time chatting with Cunningham, Chancellor Harrington and I were enjoying the evening together, White and I were discussing the evening's events, I was talking with Peacock for quite some time, Earl Pearl and I were discussing the evening's events, Ambassador Umber and I were enjoying the evening together, Blackwood and I were enjoying the evening together, I was playing cards with Inspector Ivory, I was in conversation with Coral about business matters, Ravenswood and I were discussing the evening's events, Beaumont was there with me, we were having a drink together, I was playing cards with Silver, I was playing cards with Beaumont, I was playing cards with Counselor Montgomery, I was talking with Scarlett for quite some time, I was playing cards with Baron Sienna, I was talking with Ravenswood for quite some time, I spent most of the time chatting with Viscountess White, Major Whitmore and I were discussing the evening's events, Magistrate Ruby was there with me, we were having a drink together, I was talking with Coral for quite some time, I was in conversation with Miss Azure about business matters, I was talking with Crimson for quite some time, Ambassador Gold and I were discussing the evening's events, and Lord Green and I were enjoying the evening together. I couldn't understand why when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 5:32am"
    },
    {
      "guest": "Baron Whitehall",
      "statement": "I was in the dining room right at 11:50pm, having a drink. It was a quiet evening, and I didn't expect anything unusual to happen. I was playing cards with Baron Sienna, Silver was there with me, we were having a drink together, Count Silver was there with me, we were having a drink together, Earl Pearl was there with me, we were having a drink together, I was talking with Viscount Onyx for quite some time, I was playing cards with Colonel Ravenswood, Ravenswood and I were discussing the evening's events, I was playing cards with Baron Blackwood, Crimson was there with me, we were having a drink together, Madame Northbrook was there with me, we were having a drink together, I was in conversation with White about business matters, I was in conversation with Ambassador Beaumont about business matters, I was playing cards with Duchess Cunningham, Montgomery was there with me, we were having a drink together, I was playing cards with Coral, I was in conversation with Ochre about business matters, I spent most of the time chatting with Ivory, I was talking with Whitmore for quite some time, Baron Brown was there with me, we were having a drink together, I was talking with Beaumont for quite some time, Coral and I were enjoying the evening together, Umber was there with me, we were having a drink together, I spent most of the time chatting with Scarlett, Inspector Ravenscroft and I were discussing the evening's events, I was playing cards with Peacock, I was talking with Dean Stonehaven for quite some time, I was playing cards with White, Black and I were enjoying the evening together, I was talking with Magistrate Ruby for quite some time, I was playing cards with Winthrop, Fitzgerald and I were enjoying the evening together, I was in conversation with Archbishop Whitmore about business matters, I was talking with Lady Crimson for quite some time, Solicitor Sinclair and I were enjoying the evening together, and I was in conversation with Northbrook about business matters. I didn't expect this when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 1:39am"
    },
    {
      "guest": "Mister Coral",
      "statement": "I was definitely in the kitchen at 11:50pm exactly. I was smoking a pipe and trying to relax after the day's events. I was talking with Duchess Cunningham for quite some time, Ambassador Beaumont and I were enjoying the evening together, I was talking with Magistrate Ruby for quite some time, I was playing cards with Barrister Peacock, I spent most of the time chatting with Ravenswood, I was in conversation with Baron Whitehall about business matters, Inspector Ivory and I were discussing the evening's events, I was in conversation with Counselor Montgomery about business matters, I was talking with Miss Coral for quite some time, White was there with me, we were having a drink together, I was in conversation with Ambassador Umber about business matters, I was in conversation with Ambassador Peacock about business matters, Onyx and I were discussing the evening's events, I was talking with Silver for quite some time, I was in conversation with Inspector Ravenscroft about business matters, I was talking with Ambassador Indigo for quite some time, I spent most of the time chatting with Rector Crimson, Archbishop Coral and I were enjoying the evening together, I spent most of the time chatting with Scarlett, I was playing cards with Baron Blackwood, I spent most of the time chatting with Duchess Ravenswood, Black and I were enjoying the evening together, I was in conversation with Chancellor Harrington about business matters, I was in conversation with Madame Northbrook about business matters, Pearl and I were enjoying the evening together, I was in conversation with White about business matters, I was talking with Commodore White for quite some time, Baron Sienna was there with me, we were having a drink together, I was talking with Baron Brown for quite some time, Major Whitmore was there with me, we were having a drink together, Magistrate Ochre was there with me, we were having a drink together, Blackstone and I were discussing the evening's events, I was in conversation with Doctor Scarlett about business matters, and Green and I were discussing the evening's events. I was terrified when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 2:20am"
    },
    {
      "guest": "Ambassador Umber",
      "statement": "I was in the study around 11:50pm, talking with friends. It was a quiet evening, and I didn't expect anything unusual to happen. Silver and I were discussing the evening's events, I was playing cards with Counselor Scarlett, Ochre was there with me, we were having a drink together, Blackwood and I were enjoying the evening together, Peacock was there with me, we were having a drink together, Barrister Peacock was there with me, we were having a drink together, I was in conversation with Mister Coral about business matters, I was talking with Baron Brown for quite some time, Viscount Onyx was there with me, we were having a drink together, Commodore White and I were discussing the evening's events, I was in conversation with Colonel Ravenswood about business matters, I was talking with Harrington for quite some time, I was talking with Counselor Montgomery for quite some time, Coral and I were discussing the evening's events, Madame Northbrook and I were discussing the evening's events, Cunningham and I were discussing the evening's events, I was playing cards with Stonehaven, Ambassador Beaumont and I were discussing the evening's events, I spent most of the time chatting with Sienna, Brigadier Black and I were discussing the evening's events, I was playing cards with Viscountess White, I was in conversation with Whitmore about business matters, Rector Crimson and I were enjoying the evening together, I was in conversation with Count Silver about business matters, I spent most of the time chatting with Whitehall, Inspector Ravenscroft and I were discussing the evening's events, I spent most of the time chatting with Ruby, I was playing cards with General White, I was talking with Ravenswood for quite some time, Onyx and I were enjoying the evening together, Pemberton was there with me, we were having a drink together, I was in conversation with Mister Fitzgerald about business matters, and I briefly saw Ashcroft passing by. I couldn't believe it when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 6:11am"
    },
    {
      "guest": "Solicitor Ravenscroft",
      "statement": "At that time, I was in the kitchen. I often go there in the evenings for discussing business. It's become quite a routine for me. Rector Sapphire was there with me, we were having a drink together, I was talking with Miss Azure for quite some time, Professor Blackstone was there with me, we were having a drink together, Beaumont was there with me, we were having a drink together, Solicitor Sinclair and I were enjoying the evening together, I spent most of the time chatting with Ambassador Gold, Doctor Scarlett and I were enjoying the evening together, Viscount Pemberton and I were enjoying the evening together, I spent most of the time chatting with Judge Winthrop, I was talking with Countess Grimshaw for quite some time, Doctor Grimshaw was there with me, we were having a drink together, I was playing cards with Commodore Ebony, Crimson and I were enjoying the evening together, I was in conversation with Whitmore about business matters, Duchess Summerville was there with me, we were having a drink together, I was playing cards with Archbishop Coral, Baron Blackwood was there with me, we were having a drink together, I was playing cards with Umber, I spent most of the time chatting with Whitmore, I was talking with Whitehall for quite some time, I spent most of the time chatting with Brigadier Black, Lord Green and I were discussing the evening's events, and I also think I saw Doctor Ashcroft, but I'm not entirely sure. I was terrified when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 4:40am"
    },
    {
      "guest": "Viscount Silver",
      "statement": "I was definitely in the smoking room just before midnight. I was resting quietly and trying to relax after the day's events. I was in conversation with Rector Crimson about business matters, I was in conversation with Ambassador Beaumont about business matters, I was in conversation with Scarlett about business matters, Coral and I were enjoying the evening together, Silver was there with me, we were having a drink together, I was playing cards with Magistrate Ochre, I spent most of the time chatting with Magistrate Ruby, I was in conversation with Inspector Ravenscroft about business matters, I was talking with Whitehall for quite some time, I spent most of the time chatting with Brigadier Black, I was playing cards with White, Commodore White and I were discussing the evening's events, Peacock and I were discussing the evening's events, I spent most of the time chatting with Major Beaumont, I was talking with Pearl for quite some time, I was playing cards with Dean Stonehaven, I was playing cards with Mister Coral, I was in conversation with Inspector Ivory about business matters, I was playing cards with Duchess Cunningham, Colonel Ravenswood and I were discussing the evening's events, White and I were enjoying the evening together, I was playing cards with Baron Brown, Chancellor Harrington and I were discussing the evening's events, I spent most of the time chatting with Ravenswood, I spent most of the time chatting with Coral, I was playing cards with Ambassador Peacock, I spent most of the time chatting with Whitmore, I was talking with Counselor Montgomery for quite some time, Rector Violet was there with me, we were having a drink together, I was in conversation with Mister Onyx about business matters, Miss Azure was there with me, we were having a drink together, I was playing cards with Duchess Summerville, and I was playing cards with Countess Grimshaw. I couldn't process it when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 5:50am"
    },
    {
      "guest": "Viscount Onyx",
      "statement": "Weel, I wus definitely in the library right at 11:50pm. I wus reading a book and trying tae relax efter the day's events. Ivory and I were enjoying the e'en together, I wus talking wi' Rector Crimson fer gey some time, Archbishop Coral wus thair wi' me, we were having a drink together, Silver and I were enjoying the e'en together, I wus playing cards wi' Ambassador Peacock, Stonehaven wus thair wi' me, we were having a drink together, Baron Whitehall wus thair wi' me, we were having a drink together, I wus playing cards wi' Umber, Whitmore wus thair wi' me, we were having a drink together, I wus in conversation wi' Mister Coral aboot business matters, I spent most of the time chatting wi' Pearl, I wus talking wi' Counselor Montgomery fer gey some time, I spent most of the time chatting wi' Ambassador Beaumont, I wus talking wi' Baron Blackwood fer gey some time, Chancellor Harrington and I were enjoying the e'en together, I wus in conversation wi' White aboot business matters, I wus playing cards wi' Madame Northbrook, I wus playing cards wi' Peacock, Major Beaumont wus thair wi' me, we were having a drink together, Brigadier Black and I were enjoying the e'en together, Duchess Cunningham and I were enjoying the e'en together, I spent most of the time chatting wi' General White, Indigo wus thair wi' me, we were having a drink together, I wus talking wi' Counselor Scarlett fer gey some time, Ravenswood and I were enjoying the e'en together, I spent most of the time chatting wi' Brown, Miss Coral and I were discussing the evening's events, I wus in conversation wi' Ochre aboot business matters, I wus playing cards wi' Mister Fitzgerald, I spent most of the time chatting wi' Sinclair, I spent most of the time chatting wi' Whitmore, and Barrister Beaumont and I were enjoying the e'en together. I couldnae believe it whan I heard aboot whit happened. I dinnae ken anythin' aboot a note. This is the first I'm hearing of it, and I can assure ye I had nothin' tae do wi' it.",
      "timestamp": "Interview conducted at 4:32am"
    },
    {
      "guest": "Duchess Cunningham",
      "statement": "At that time, I was in the attic. I often go there in the evenings for listening to music. It's become quite a routine for me. I was playing cards with Rector Crimson, I was in conversation with Commodore White about business matters, I was talking with Coral for quite some time, I was in conversation with Dean Stonehaven about business matters, Montgomery was there with me, we were having a drink together, Baron Whitehall and I were enjoying the evening together, Ambassador Umber was there with me, we were having a drink together, I spent most of the time chatting with Sienna, Pearl was there with me, we were having a drink together, I was playing cards with Mister Coral, I was talking with Madame Northbrook for quite some time, Viscountess White was there with me, we were having a drink together, I was talking with Baron Blackwood for quite some time, Brown and I were discussing the evening's events, Harrington and I were enjoying the evening together, Ochre and I were discussing the evening's events, I spent most of the time chatting with Ravenscroft, Ambassador Peacock and I were enjoying the evening together, Counselor Scarlett and I were discussing the evening's events, I spent most of the time chatting with Indigo, Ivory was there with me, we were having a drink together, I spent most of the time chatting with Ravenswood, I was talking with Magistrate Ruby for quite some time, Brigadier Black and I were enjoying the evening together, I was in conversation with Ravenswood about business matters, Beaumont and I were enjoying the evening together, Viscount Onyx and I were discussing the evening's events, I was talking with General White for quite some time, Whitmore and I were discussing the evening's events, I was talking with Viscount Pemberton for quite some time, I was in conversation with Judge Winthrop about business matters, I was talking with Sapphire for quite some time, I was playing cards with Mister Fitzgerald, and Lady Crimson and I were discussing the evening's events. I was terrified when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 2:57am"
    },
    {
      "guest": "Ambassador Beaumont",
      "statement": "Well, I can tell you exactly where I was - in the garden, listening to music. I remember because I was there from about 11:30pm until well after midnight. I was playing cards with Major Beaumont, I was playing cards with Viscount Silver, I was playing cards with Scarlett, Baron Whitehall and I were enjoying the evening together, Ambassador Peacock was there with me, we were having a drink together, Baron Blackwood and I were enjoying the evening together, I was talking with Duchess Ravenswood for quite some time, I was in conversation with Stonehaven about business matters, I was talking with Ambassador Umber for quite some time, Onyx was there with me, we were having a drink together, Crimson and I were enjoying the evening together, Brigadier Black was there with me, we were having a drink together, Archbishop Coral was there with me, we were having a drink together, I spent most of the time chatting with Coral, Commodore White and I were enjoying the evening together, Whitmore and I were discussing the evening's events, General White and I were enjoying the evening together, I was talking with Barrister Peacock for quite some time, I spent most of the time chatting with Earl Pearl, Miss Coral was there with me, we were having a drink together, Counselor Montgomery and I were discussing the evening's events, I was in conversation with Madame Northbrook about business matters, I spent most of the time chatting with Silver, I was in conversation with White about business matters, Colonel Ravenswood and I were discussing the evening's events, I was talking with Brown for quite some time, I spent most of the time chatting with Sienna, Duchess Cunningham and I were discussing the evening's events, Chancellor Harrington and I were enjoying the evening together, Ambassador Indigo was there with me, we were having a drink together, Commodore Ebony and I were discussing the evening's events, Ambassador Gold was there with me, we were having a drink together, I was playing cards with Rector Sapphire, and I was playing cards with Ambassador Northbrook. I didn't expect this when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 4:27am"
    },
    {
      "guest": "Barrister Peacock",
      "statement": "I was definitely in the ballroom around 11:50pm. I was resting quietly and trying to relax after the day's events. Baron Sienna was there with me, we were having a drink together, Peacock and I were enjoying the evening together, Commodore White and I were discussing the evening's events, Silver was there with me, we were having a drink together, I spent most of the time chatting with Earl Pearl, Archbishop Coral and I were enjoying the evening together, I was playing cards with Beaumont, I was talking with Mister Coral for quite some time, I spent most of the time chatting with Baron Blackwood, Major Whitmore and I were enjoying the evening together, Black was there with me, we were having a drink together, Montgomery and I were enjoying the evening together, Counselor Scarlett and I were discussing the evening's events, Inspector Ravenscroft was there with me, we were having a drink together, I was talking with Count Silver for quite some time, I was talking with Umber for quite some time, Chancellor Harrington and I were discussing the evening's events, I was in conversation with Baron Brown about business matters, I was in conversation with Miss Coral about business matters, Baron Whitehall and I were discussing the evening's events, Rector Crimson was there with me, we were having a drink together, Ravenswood and I were discussing the evening's events, I spent most of the time chatting with Magistrate Ochre, Magistrate Ruby and I were enjoying the evening together, Beaumont was there with me, we were having a drink together, Viscount Onyx was there with me, we were having a drink together, Northbrook was there with me, we were having a drink together, Mister Onyx and I were enjoying the evening together, and Archbishop Whitmore and I were discussing the evening's events. I couldn't process it when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 1:34am"
    },
    {
      "guest": "Counselor Montgomery",
      "statement": "At that time, I wus in the attic. I often go thair in the evenings fer discussing business. It's become gey a routine fer me. I wus playing cards wi' Archbishop Coral, I wus in conversation wi' Crimson aboot business matters, Whitehall and I were discussing the evening's events, Ambassador Beaumont wus thair wi' me, we were having a drink together, Brigadier Black and I were enjoying the e'en together, I wus talking wi' White fer gey some time, I wus playing cards wi' Dean Stonehaven, I wus in conversation wi' Miss Coral aboot business matters, Counselor Scarlett and I were discussing the evening's events, I spent most of the time chatting wi' Sienna, I spent most of the time chatting wi' Mister Coral, Blackwood and I were discussing the evening's events, Ravenswood wus thair wi' me, we were having a drink together, I spent most of the time chatting wi' Brown, Madame Northbrook and I were enjoying the e'en together, I wus in conversation wi' Duchess Ravenswood aboot business matters, General White and I were discussing the evening's events, I wus in conversation wi' Ochre aboot business matters, I wus playing cards wi' Silver, I wus talking wi' Viscount Onyx fer gey some time, I spent most of the time chatting wi' Ambassador Umber, I wus talking wi' Ambassador Peacock fer gey some time, White wus thair wi' me, we were having a drink together, I wus talking wi' Harrington fer gey some time, Magistrate Ruby wus thair wi' me, we were having a drink together, I wus in conversation wi' Viscount Silver aboot business matters, I spent most of the time chatting wi' Ivory, I wus playing cards wi' Inspector Ravenscroft, I spent most of the time chatting wi' Cunningham, I wus playing cards wi' Indigo, I wus playing cards wi' Mister Onyx, I wus in conversation wi' Baron Nightingale aboot business matters, Solicitor Sinclair and I were discussing the evening's events, I spent most of the time chatting wi' Blackstone, Winthrop wus thair wi' me, we were having a drink together, and Someone who might hae been Ashcroft walked by quickly. I dinnae ken whit tae reckon whan I heard aboot whit happened. I dinnae ken anythin' aboot a note. This is the first I'm hearing of it, and I can assure ye I had nothin' tae do wi' it.",
      "timestamp": "Interview conducted at 4:33am"
    },
    {
      "guest": "Major Whitmore",
      "statement": "Well, I can tell you exactly where I was - in the gallery, resting quietly. I remember because I was there from about 11:30pm until well after midnight. Brown and I were discussing the evening's events, Ambassador Umber and I were enjoying the evening together, I was talking with Sienna for quite some time, I spent most of the time chatting with Counselor Montgomery, I spent most of the time chatting with Viscount Onyx, Ambassador Peacock and I were enjoying the evening together, I spent most of the time chatting with Earl Pearl, I was talking with Peacock for quite some time, I was in conversation with Blackwood about business matters, Inspector Ravenscroft and I were enjoying the evening together, I was playing cards with Stonehaven, I was talking with Beaumont for quite some time, I was in conversation with Madame Northbrook about business matters, Beaumont was there with me, we were having a drink together, I was playing cards with Silver, I was in conversation with Chancellor Harrington about business matters, Indigo and I were discussing the evening's events, I was in conversation with Commodore White about business matters, General White was there with me, we were having a drink together, Archbishop Coral and I were discussing the evening's events, Magistrate Ochre and I were discussing the evening's events, I was talking with Viscountess White for quite some time, I was playing cards with Ravenswood, I was playing cards with Crimson, Ravenswood and I were discussing the evening's events, Inspector Ivory and I were enjoying the evening together, I was talking with Duchess Cunningham for quite some time, I was playing cards with Count Silver, I was talking with Brigadier Black for quite some time, I was in conversation with Miss Azure about business matters, and Mister Fitzgerald was there with me, we were having a drink together. I didn't know what to think when I heard about what happened. As for that note you mentioned, I know nothing about it. I didn't write any note, and I certainly didn't receive one.",
      "timestamp": "Interview conducted at 2:20am"
    },
    {
      "guest": "Count Silver",
      "statement": "Well, I can tell you exactly where I was - in the kitchen, resting quietly. I remember because I was there from about 11:30pm until well after midnight. Ivory and I were discussing the evening's events, Brown and I were enjoying the evening together, I was talking with Northbrook for quite some time, I was playing cards with Viscount Onyx, Blackwood and I were enjoying the evening together, I spent most of the time chatting with Major Beaumont, Miss Coral was there with me, we were having a drink together, Indigo and I were enjoying the evening together, I spent most of the time chatting with Mister Coral, I was talking with Ravenswood for quite some time, Ruby and I were discussing the evening's events, Whitehall and I were discussing the evening's events, I spent most of the time chatting with Whitmore, Scarlett was there with me, we were having a drink together, I was in conversation with Commodore White about business matters, Viscountess White was there with me, we were having a drink together, Ambassador Beaumont and I were discussing the evening's events, I spent most of the time chatting with Barrister Peacock, Counselor Montgomery and I were enjoying the evening together, Baron Sienna and I were enjoying the evening together, I was talking with Viscount Silver for quite some time, I spent most of the time chatting with Duchess Cunningham, Dean Stonehaven and I were discussing the evening's events, I spent most of the time chatting with Earl Pearl, I was in conversation with Chancellor Harrington about business matters, I was in conversation with Ambassador Umber about business matters, I was talking with Rector Crimson for quite some time, Ravenswood and I were discussing the evening's events, I was playing cards with White, I was talking with Inspector Ravenscroft for quite some time, Coral was there with me, we were having a drink together, I was playing cards with Azure, I spent most of the time chatting with Doctor Grimshaw, and I was playing cards with Sapphire. I couldn't understand why when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 6:30am"
    },
    {
      "guest": "Archbishop Coral",
      "statement": "At that time, I was in the terrace. I often go there in the evenings for having a drink. It's become quite a routine for me. I was talking with Rector Crimson for quite some time, I was playing cards with Inspector Ravenscroft, I was talking with Duchess Ravenswood for quite some time, I spent most of the time chatting with Barrister Peacock, I was talking with Baron Blackwood for quite some time, Commodore White and I were enjoying the evening together, I spent most of the time chatting with Viscount Onyx, I was in conversation with Ambassador Beaumont about business matters, I was talking with Chancellor Harrington for quite some time, Baron Brown was there with me, we were having a drink together, I was talking with Beaumont for quite some time, I was playing cards with Sienna, Montgomery and I were enjoying the evening together, Major Whitmore and I were enjoying the evening together, Silver and I were discussing the evening's events, I spent most of the time chatting with Earl Pearl, Cunningham and I were enjoying the evening together, White and I were enjoying the evening together, Black was there with me, we were having a drink together, I was talking with Miss Coral for quite some time, I was talking with Ravenswood for quite some time, Ruby was there with me, we were having a drink together, I was in conversation with Dean Stonehaven about business matters, I spent most of the time chatting with Ambassador Indigo, Magistrate Ochre was there with me, we were having a drink together, Ivory was there with me, we were having a drink together, I was playing cards with Scarlett, Ambassador Umber was there with me, we were having a drink together, I was talking with Baron Whitehall for quite some time, Silver was there with me, we were having a drink together, I spent most of the time chatting with Ambassador Peacock, I spent most of the time chatting with Sinclair, and I was playing cards with Winthrop. I didn't know what to think when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 5:31am"
    },
    {
      "guest": "Ambassador Northbrook",
      "statement": "Well, I can tell you exactly where I was - in the study, listening to music. I remember because I was there from about 11:30pm until well after midnight. Lord Green was there with me, we were having a drink together. I was worried about everyone when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 5:30am"
    },
    {
      "guest": "Solicitor Beaumont",
      "statement": "I was definitely in the terrace when the clock struck twelve. I was playing cards and trying to relax after the day's events. I spent most of the time chatting with Ravenscroft, Sinclair and I were discussing the evening's events, Crimson was there with me, we were having a drink together, I spent most of the time chatting with Countess Grimshaw, I was in conversation with Pemberton about business matters, I spent most of the time chatting with Mister Fitzgerald, I spent most of the time chatting with Doctor Grimshaw, I was talking with Ambassador Gold for quite some time, Winthrop was there with me, we were having a drink together, I was playing cards with Baron Nightingale, Scarlett and I were discussing the evening's events, I was playing cards with Rector Violet, Duchess Summerville and I were discussing the evening's events, Professor Blackstone and I were enjoying the evening together, Ebony and I were enjoying the evening together, Archbishop Whitmore was there with me, we were having a drink together, Mister Coral was there with me, we were having a drink together, I was playing cards with Silver, I spent most of the time chatting with Major Whitmore, I was playing cards with Earl Pearl, Viscount Onyx was there with me, we were having a drink together, Chancellor Harrington and I were discussing the evening's events, I was talking with Ravenswood for quite some time, Archbishop Coral was there with me, we were having a drink together, and I briefly saw Ashcroft passing by. I was confused when I heard about what happened. I don't know anything about a note. This is the first I'm hearing of it, and I can assure you I had nothing to do with it.",
      "timestamp": "Interview conducted at 4:54am"
    },
    {
      "guest": "Rector Crimson",
      "statement": "I was definitely in the attic late in the evening. I was smoking a pipe and trying to relax after the day's events. I was talking with Ochre for quite some time, Baron Blackwood and I were discussing the evening's events, Barrister Peacock and I were enjoying the evening together, I was talking with Duchess Ravenswood for quite some time, White and I were enjoying the evening together, Inspector Ivory and I were enjoying the evening together, Duchess Cunningham and I were enjoying the evening together, Viscount Silver and I were enjoying the evening together, I was in conversation with Counselor Scarlett about business matters, I was talking with Indigo for quite some time, I was in conversation with Peacock about business matters, Mister Coral and I were discussing the evening's events, Counselor Montgomery and I were discussing the evening's events, I was playing cards with Chancellor Harrington, I was in conversation with Baron Brown about business matters, I was talking with Major Whitmore for quite some time, I spent most of the time chatting with White, Ruby and I were enjoying the evening together, Inspector Ravenscroft was there with me, we were having a drink together, I spent most of the time chatting with Count Silver, I spent most of the time chatting with Baron Sienna, Major Beaumont and I were discussing the evening's events, Ambassador Beaumont was there with me, we were having a drink together, Black was there with me, we were having a drink together, I was talking with General White for quite some time, I spent most of the time chatting with Archbishop Coral, I was playing cards with Umber, I spent most of the time chatting with Pearl, I spent most of the time chatting with Doctor Scarlett, Doctor Grimshaw was there with me, we were having a drink together, Rector Violet was there with me, we were having a drink together, Beaumont was there with me, we were having a drink together, and I briefly saw Doctor Ashcroft passing by. I couldn't understand why when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 6:46am"
    },
    {
      "guest": "Inspector Ravenscroft",
      "statement": "I was definitely in the hall just before midnight. I was having a drink and trying to relax after the day's events. I spent most of the time chatting with Ravenswood, I was playing cards with Inspector Ivory, Ambassador Beaumont was there with me, we were having a drink together, Coral and I were enjoying the evening together, General White and I were discussing the evening's events, Ochre and I were enjoying the evening together, I was playing cards with Colonel Ravenswood, Ambassador Peacock and I were enjoying the evening together, I was in conversation with Major Whitmore about business matters, Viscount Onyx and I were enjoying the evening together, I was talking with Harrington for quite some time, I was talking with Baron Sienna for quite some time, Mister Coral was there with me, we were having a drink together, Beaumont and I were enjoying the evening together, Northbrook and I were discussing the evening's events, I was in conversation with Counselor Montgomery about business matters, Silver and I were discussing the evening's events, I was talking with Baron Blackwood for quite some time, I was in conversation with Commodore White about business matters, I was playing cards with Magistrate Ruby, Viscount Silver and I were enjoying the evening together, I spent most of the time chatting with Dean Stonehaven, I was playing cards with Cunningham, I was in conversation with Brown about business matters, Counselor Scarlett was there with me, we were having a drink together, Umber was there with me, we were having a drink together, I was playing cards with Earl Pearl, I was playing cards with Archbishop Whitmore, Summerville was there with me, we were having a drink together, I spent most of the time chatting with Commodore Ebony, and I was talking with Crimson for quite some time. I couldn't believe it when I heard about what happened. A note? I have no idea what you're talking about. I didn't write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 6:52am"
    },
    {
      "guest": "Lady Crimson",
      "statement": "At that time, I was in the ballroom. I often go there in the evenings for playing cards. It's become quite a routine for me. Solicitor Ravenscroft and I were enjoying the evening together, I spent most of the time chatting with Blackstone, I spent most of the time chatting with Solicitor Sinclair, I was in conversation with Solicitor Beaumont about business matters, Mister Onyx and I were discussing the evening's events, Viscount Pemberton was there with me, we were having a drink together, I was playing cards with Countess Grimshaw, I spent most of the time chatting with Doctor Scarlett, I was in conversation with Archbishop Whitmore about business matters, I was playing cards with Mister Fitzgerald, Sapphire and I were discussing the evening's events, I spent most of the time chatting with Rector Violet, I was talking with Azure for quite some time, Commodore Ebony and I were discussing the evening's events, Ambassador Gold and I were discussing the evening's events, Counselor Montgomery was there with me, we were having a drink together, I was talking with Baron Blackwood for quite some time, I spent most of the time chatting with Ravenswood, Umber and I were enjoying the evening together, Ravenscroft was there with me, we were having a drink together, I was playing cards with White, I spent most of the time chatting with Chancellor Harrington, and I was talking with Northbrook for quite some time. I didn't expect this when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 6:53am"
    },
    {
      "guest": "Doctor Grimshaw",
      "statement": "At that time, I was in the study. I often go there in the evenings for enjoying the evening. It's become quite a routine for me. I was playing cards with Duchess Summerville, Commodore Ebony and I were discussing the evening's events, Violet and I were discussing the evening's events, I was playing cards with Judge Winthrop, I was playing cards with Countess Grimshaw, I was in conversation with Solicitor Ravenscroft about business matters, Blackstone and I were enjoying the evening together, I was in conversation with Mister Fitzgerald about business matters, Nightingale was there with me, we were having a drink together, I spent most of the time chatting with Scarlett, Beaumont and I were enjoying the evening together, Archbishop Whitmore was there with me, we were having a drink together, Sinclair and I were discussing the evening's events, Mister Onyx was there with me, we were having a drink together, I was talking with Gold for quite some time, Lady Crimson and I were enjoying the evening together, I was in conversation with Peacock about business matters, Baron Whitehall and I were discussing the evening's events, I spent most of the time chatting with Scarlett, White and I were discussing the evening's events, Baron Sienna and I were enjoying the evening together, I was in conversation with Umber about business matters, General White and I were enjoying the evening together, I was playing cards with Colonel Ravenswood, Baron Blackwood and I were enjoying the evening together, and Coral was there with me, we were having a drink together. I couldn't understand why when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 5:24am"
    },
    {
      "guest": "Inspector Ivory",
      "statement": "Well, I can tell ye exactly whaur I wus - in the lounge, discussing business. I remember because I wus thair frae aboot 11:30pm until weel efter midnight. I wus talking wi' Major Beaumont fer gey some time, I wus in conversation wi' Earl Pearl aboot business matters, I wus playing cards wi' Silver, Counselor Montgomery wus thair wi' me, we were having a drink together, I wus in conversation wi' Archbishop Coral aboot business matters, Baron Whitehall and I were enjoying the e'en together, I spent most of the time chatting wi' Baron Brown, I wus playing cards wi' Rector Crimson, I spent most of the time chatting wi' Ambassador Indigo, I wus talking wi' White fer gey some time, I spent most of the time chatting wi' Whitmore, I wus in conversation wi' Ambassador Umber aboot business matters, Silver and I were enjoying the e'en together, I wus playing cards wi' Colonel Ravenswood, I spent most of the time chatting wi' Sienna, I spent most of the time chatting wi' Ravenscroft, Coral and I were enjoying the e'en together, I wus playing cards wi' Barrister Peacock, Madame Northbrook and I were enjoying the e'en together, I wus in conversation wi' Chancellor Harrington aboot business matters, I wus in conversation wi' Peacock aboot business matters, Viscount Onyx wus thair wi' me, we were having a drink together, Blackwood wus thair wi' me, we were having a drink together, General White wus thair wi' me, we were having a drink together, I wus in conversation wi' Ravenswood aboot business matters, Ruby wus thair wi' me, we were having a drink together, I spent most of the time chatting wi' Magistrate Ochre, I wus talking wi' Coral fer gey some time, I wus playing cards wi' Scarlett, I spent most of the time chatting wi' Brigadier Black, I wus talking wi' Beaumont fer gey some time, Duchess Cunningham wus thair wi' me, we were having a drink together, I wus talking wi' Fitzgerald fer gey some time, and I spent most of the time chatting wi' Commodore Ebony. I dinnae expect this whan I heard aboot whit happened. A note? I hae naw idea whit you're talking about. I dinnae write anything, and nobody gave me any note either.",
      "timestamp": "Interview conducted at 5:29am"
    },
    {
      "guest": "Ambassador Peacock",
      "statement": "I was in the conservatory just before midnight, playing cards. It was a quiet evening, and I didn't expect anything unusual to happen. I spent most of the time chatting with Ambassador Umber, I was playing cards with Onyx, Peacock was there with me, we were having a drink together, I was in conversation with Blackwood about business matters, Ambassador Beaumont and I were enjoying the evening together, I spent most of the time chatting with Duchess Ravenswood, White and I were discussing the evening's events, I was talking with White for quite some time, Ochre and I were discussing the evening's events, I spent most of the time chatting with Earl Pearl, Ruby and I were enjoying the evening together, Chancellor Harrington was there with me, we were having a drink together, I spent most of the time chatting with Inspector Ravenscroft, I was in conversation with Colonel Ravenswood about business matters, Ivory and I were discussing the evening's events, Duchess Cunningham was there with me, we were having a drink together, I was playing cards with Rector Crimson, I was talking with Silver for quite some time, I was in conversation with Baron Brown about business matters, I was talking with Counselor Montgomery for quite some time, I was in conversation with Baron Sienna about business matters, Beaumont and I were enjoying the evening together, Coral and I were discussing the evening's events, Major Whitmore and I were enjoying the evening together, Commodore White was there with me, we were having a drink together, Counselor Scarlett was there with me, we were having a drink together, I was playing cards with Dean Stonehaven, I spent most of the time chatting with Northbrook, I was in conversation with Solicitor Ravenscroft about business matters, Solicitor Beaumont and I were enjoying the evening together, Baron Nightingale was there with me, we were having a drink together, Duchess Summerville and I were discussing the evening's events, and I was talking with Whitmore for quite some time. I couldn't believe it when I heard about what happened. That note wasn't mine, I can tell you that with certainty. I don't know who wrote it or why.",
      "timestamp": "Interview conducted at 6:17am"
    },
    {
      "guest": "Duchess Summerville",
      "statement": "I was in the dining room around 11:50pm, smoking a pipe. It was a quiet evening, and I didn't expect anything unusual to happen. I spent most of the time chatting with Grimshaw, Solicitor Sinclair and I were discussing the evening's events, Mister Fitzgerald and I were enjoying the evening together, I was talking with Beaumont for quite some time, I was in conversation with Violet about business matters, Mister Onyx and I were enjoying the evening together, Archbishop Whitmore and I were discussing the evening's events, Rector Sapphire and I were discussing the evening's events, I was talking with Crimson for quite some time, Winthrop and I were discussing the evening's events, Baron Nightingale was there with me, we were having a drink together, I was talking with Blackstone for quite some time, I was playing cards with Gold, Viscount Pemberton and I were discussing the evening's events, I spent most of the time chatting with Azure, White and I were enjoying the evening together, I was playing cards with Duchess Cunningham, I was in conversation with Barrister Peacock about business matters, Commodore White and I were enjoying the evening together, Barrister Beaumont and I were discussing the evening's events, and Lord Green and I were enjoying the evening together. I didn't expect this when I heard about what happened. I'm afraid I can't help you with any note. I didn't write one, didn't receive one, and didn't see one.",
      "timestamp": "Interview conducted at 3:46am"
    },
    {
      "guest": "Dean Stonehaven",
      "statement": "You know, I was just smoking a pipe in the library right at 11:50pm. I always spend my evenings there, it's my favorite spot in the house. Inspector Ivory was there with me, we were having a drink together, Count Silver was there with me, we were having a drink together, White and I were enjoying the evening together, Montgomery and I were enjoying the evening together, I was playing cards with Mister Coral, I was talking with Viscount Silver for quite some time, I spent most of the time chatting with Archbishop Coral, Ochre and I were enjoying the evening together, Baron Blackwood was there with me, we were having a drink together, Rector Crimson was there with me, we were having a drink together, Brigadier Black and I were enjoying the evening together, I was in conversation with Ravenswood about business matters, I was in conversation with Pearl about business matters, I spent most of the time chatting with Inspector Ravenscroft, I was playing cards with Viscount Onyx, Barrister Peacock and I were enjoying the evening together, I was playing cards with Sienna, I was playing cards with Viscountess White, Duchess Cunningham and I were enjoying the evening together, I was playing cards with Colonel Ravenswood, I spent most of the time chatting with Indigo, Miss Coral and I were enjoying the evening together, Madame Northbrook was there with me, we were having a drink together, Commodore White and I were discussing the evening's events, I was in conversation with Scarlett about business matters, Ruby and I were discussing the evening's events, I was playing cards with Harrington, I was talking with Beaumont for quite some time, and Violet was there with me, we were having a drink together. I didn't know what to think when I heard about what happened. As for that note you mentioned, I know nothing about it. I didn't write any note, and I certainly didn't receive one.",
      "timestamp": "Interview conducted at 4:34am"
    }
  ]
}